УТ_для_edt.РасширениеСмарт/src/Documents/ПриобретениеТоваровУслуг/ПриобретениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеТоваровУслуг</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПоступлениеПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗаказПоставщику</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УдалитьТоварноТранспортнаяНакладнаяЕГАИС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетГрузоотправителя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Принял</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПринялДолжность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РегистрироватьЦеныПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВернутьМногооборотнуюТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВозвратаМногооборотнойТары</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТребуетсяЗалогЗаТару</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Груз</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатусГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4e5758e0-b3c6-40b0-8f37-e87b287ff527">
    <name>НаименованиеВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НоменклатураПартнера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЦеныПоставщика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПроцентРучнойСкидки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>5</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЗаказПоставщику</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СписатьНаРасходы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерПаспорта</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>25</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>УдалитьАналитикаУчетаПартий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаНДСВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="24a8e9e7-406e-4d35-99d6-d4196c662964">
      <name>ДатаВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f79abc1e-3587-4e59-87ea-28756ca0bbbf">
      <name>НомерВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f498a97f-85c5-40ae-b536-2cf82a9f18cc">
      <name>НаименованиеВходящегоДокумента</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>128</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="b27c8e49-2808-4d32-8ad2-1242e50c1680">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Documents/ПриобретениеТоваровУслуг/Forms/ФормаДокумента/Module.bsl
#Область ПеренесеноСДоработками

#КонецОбласти

#Область ДоработкиСмарт

//Богус++
&НаКлиенте
Процедура ГрузПриИзменении(Элемент)
	//Элементы.СтатусГруза.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Груз);
	//Если Не ЗначениеЗаполнено(Объект.Груз) Тогда
	//	Объект.СтатусГруза = ПредопределенноеЗначение("Перечисление.СтатусыГрузов.ПустаяСсылка");
	//ИначеЕсли ЗначениеЗаполнено(Объект.Груз)
	//	И Объект.СтатусГруза = ПредопределенноеЗначение("Перечисление.СтатусыГрузов.ПустаяСсылка") Тогда
	//	Объект.СтатусГруза = ПредопределенноеЗначение("Перечисление.СтатусыГрузов.ВПути");
	//КонецЕсли;
	// Фролов+
	ДоступностьЭлементаГруз();
	// Фролов-
КонецПроцедуры
//Богус--

// Фролов+
&НаСервере
Процедура ДоступностьЭлементаГруз()
	Элементы.ДекорацияГруз.Заголовок=Объект.Груз.СтатусГруза;
	Если Объект.Груз.СтатусГруза=ПредопределенноеЗначение("Перечисление.СтатусыГрузов.Принят") Тогда 
		Элементы.Груз.ТолькоПросмотр=Не РольДоступна("ПолныеПрава");
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.Зеленый;
	Иначе
		Элементы.ДекорацияГруз.ЦветТекста=WebЦвета.ТемноОранжевый;
	КонецЕсли;	
КонецПроцедуры	

//Смарт Фролов+ по заявке № 221 "Товары в пути" 
&НаКлиенте
Процедура смартДопРасходыВнесеныПриИзменении(Элемент)
    //++ смарт:Подкин #962 05.04.2022 17:14:49
    ОписаниеОповещения = Новый ОписаниеОповещения("ДопРасходыОтвет", ЭтотОбъект);
    ПоказатьВопрос(ОписаниеОповещения, "Вы уверены что нужно ввести Доп. расходы?",РежимДиалогаВопрос.ДаНет, 60); 
    //-- смарт:Подкин #962 05.04.2022 17:14:49
КонецПроцедуры

//Вынести в отдельную процедуру
//++ смарт:Подкин #962 05.04.2022 17:14:49
&НаКлиенте
Процедура ДопРасходыОтвет(РезультатВопроса, ДополнительныеПараметры) Экспорт 
    
    Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
        ДанныеЗаписи=смартДокРасходыВнесеныИзменениеСервер(Объект.Ссылка,смартДопРасходыВнесены);
        Если ДанныеЗаписи.Результат Тогда 
            смартОтветственныйЗаДопРасходы=ДанныеЗаписи.Ответственный;
            Оповестить("Запись_ПоступлениеТоваров");
        Иначе
            ОбщегоНазначенияКлиент.СообщитьПользователю(ДанныеЗаписи.Ошибка,,"смартДопРасходыВнесены");
        КонецЕсли;
    Иначе
        смартДопРасходыВнесены=Ложь;
    КонецЕсли;
    
КонецПроцедуры //-- смарт:Подкин #962 05.04.2022 17:14:49

//Смарт Фролов+ по заявке № 221 "Товары в пути"
&НаСервереБезКонтекста
Функция смартДокРасходыВнесеныИзменениеСервер(Ссылка,ДопРасходыВнесены)
	ДанныеВозврата=Новый Структура("Результат,Ответственный,Ошибка",Истина,Пользователи.ТекущийПользователь());
	Попытка
		смартСервер.ИзменитьДополнительноеСвойство(Ссылка,"смартДопРасходыВнесены",ДопРасходыВнесены);
		смартСервер.ИзменитьДополнительноеСвойство(Ссылка,"смартОтветственныйЗаДопРасходы",ДанныеВозврата.Ответственный);
	Исключение
		ДанныеВозврата.Результат=Ложь;
		ДанныеВозврата.Ошибка=ОписаниеОшибки();
	КонецПопытки;	
	Возврат ДанныеВозврата;	
КонецФункции	


//++ смарт:ММ #006 144 04.12.2019   
&НаСервере
Процедура НастроитьВидимостьДоступностьЭлементов()
	
    смартОбщегоНазначения.НастроитьВидимостьЭлементовФормы(ЭтаФорма);
    
    //++ смарт:Подкин #962 05.04.2022 16:23:56
    Элементы.смартДопРасходыВнесены.Доступность=РольДоступна("ПолныеПрава")
    ИЛИ 
    Объект.ХозяйственнаяОперация=Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпортуТоварыВПути;
    //-- смарт:Подкин #962 05.04.2022 16:23:56 
    
    // Смарт Фролов+
    //Элементы.смартДопРасходыВнесены.Доступность=РольДоступна("ПолныеПрава") Или (РольДоступна("смарт_ОтветственныйЗаДопРасходы") И Не смартДопРасходыВнесены);
    // Фролов-
КонецПроцедуры //-- смарт:ММ 04.12.2019

//++ смарт:ММ 221 19.07.2021
Процедура ДобавитьЭлементыПрограммно()
	
	смартЗапчастиГарантийные = Элементы.Вставить("смартЗапчастиГарантийные", Тип("ПолеФормы"), Элементы.ГруппаОсновное, Элементы.Комментарий);
	смартЗапчастиГарантийные.Вид = ВидПоляФормы.ПолеФлажка;
	смартЗапчастиГарантийные.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	смартЗапчастиГарантийные.ПутьКДанным = "Объект.смартЗапчастиГарантийные";
	смартЗапчастиГарантийные.Заголовок = "Запчасти гарантийные (смарт)";
	
	//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		смартЗапчастиГарантийные.ТолькоПросмотр = Истина;
	КонецЕсли;
	//-- #Б1598 смарт: Шляпников 09.12.2024

	//++#1374 смарт: Балашов 19.06.2023 //Разработать учет закупок в разрезе Контейнеров
	Если Не Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика Тогда
		МассивДобавляемыхРеквизитов = Новый Массив;
		Реквизит_Контейнер = Новый РеквизитФормы("Контейнеры", Новый ОписаниеТипов("Строка"),"Объект.Товары", "Контейнеры");
		МассивДобавляемыхРеквизитов.Добавить(Реквизит_Контейнер); 

		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 

		ЭлементХарактеристика = Элементы.Товары.ПодчиненныеЭлементы.Найти("ТоварыХарактеристика");
		
		НоваяКолонка = Элементы.Вставить("Контейнеры", Тип("ПолеФормы"), Элементы.Товары, ЭлементХарактеристика); 
		НоваяКолонка.Заголовок = "Контейнеры"; 
		НоваяКолонка.ПутьКДанным = "Объект.Товары.Контейнеры"; 
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ГиперссылкаЯчейки = истина;
		НоваяКолонка.ТолькоПросмотр = истина;
		НоваяКолонка.АвтоВысотаЯчейки = истина; 

		Команда = ЭтаФорма.Команды.Добавить("ЗаполнитьКонтейнеры");
	   	Команда.Действие = "смартЗаполнитьКонтейнеры";

		НовЭлемент = Элементы.Добавить("ЗаполнитьКонтейнеры", Тип("КнопкаФормы"), Элементы.Товары.КоманднаяПанель);
		НовЭлемент.Заголовок = "Заполнить контейнеры";
	   	НовЭлемент.ИмяКоманды = "ЗаполнитьКонтейнеры";
		
	КонецЕсли;	
	//--#1374 смарт: Балашов 19.06.2023	
	
КонецПроцедуры //-- смарт:ММ 19.07.2021

//++#1374 смарт: Балашов 05.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартПеречитатьДанныеКонтейнеров()
	Для Каждого СтрТовары Из Объект.Товары Цикл
		Если ЗначениеЗаполнено(СтрТовары.смартКонтейнер) Тогда
			ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(СтрТовары.смартКонтейнер); 
			Если СтрТовары.Свойство("Контейнеры") Тогда
				СтрТовары.Контейнеры = смартОбщегоНазначения.смартКонтейнерыВСтроку(ЗначениеДляКонтейнера);
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры//--#1374 смарт: Балашов 05.07.2023

//++#1374 смарт: Балашов 04.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смартПроверитьВозможностьЗаписиПоКонтейнерам(Отказ)
	Если Не Отказ Тогда
		Для Каждого стрТовар Из Объект.Товары Цикл
			Если ЗначениеЗаполнено(стрТовар.смартКонтейнер) Тогда
				ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(стрТовар.смартКонтейнер);
				Если смартКоличествоКонтейнеров(ЗначениеДляКонтейнера) > 1 Тогда
					Отказ = истина;
					Сообщить("В строке №"+стрТовар.НомерСтроки+" одной позиции номенклатуры соответствует несколько контейнеров, 
					|необходимо разбить строку, чтобы в одной строке был один контейнер");
					Возврат;
				КонецЕсли;	
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры//--#1374 смарт: Балашов 04.07.2023

//++#1374 смарт: Балашов 04.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартКоличествоКонтейнеров(МассивКонтейнеров)
	Сч = 0; 
	Для Каждого Контейнер Из МассивКонтейнеров Цикл
		Если Контейнер.Пометка Тогда Сч = Сч + 1; КонецЕсли;				
	КонецЦикла;	                                            
	Возврат Сч;
КонецФункции//--#1374 смарт: Балашов 04.07.2023	

//++#1374 смарт: Балашов 03.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартПолучитСписокКонтейнеров(Груз)
	Запрос = Новый Запрос;	
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	смартСобытияКонтейнеров.Груз КАК Груз,
		|	смартСобытияКонтейнеров.Контейнер КАК Контейнер
		|ИЗ
		|	РегистрСведений.смартСобытияКонтейнеров КАК смартСобытияКонтейнеров
		|ГДЕ
		|	смартСобытияКонтейнеров.Груз = &Груз
		|";
	Запрос.УстановитьПараметр("Груз",Груз);
	СписокКонтейнеров = Новый СписокЗначений;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокКонтейнеров.Добавить(Выборка.Контейнер,,ложь);
	КонецЦикла;	                           
	Возврат СписокКонтейнеров;
КонецФункции//--#1374 смарт: Балашов 03.07.2023

//++#1374 смарт: Балашов 03.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартЗаполнитьКонтейнеры(Элемент)
	Если Элементы.Товары.ВыделенныеСтроки.Количество() > 1 Тогда
		СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);
	Иначе	
		ТекДанные = Элементы.Товары.ТекущиеДанные;
		Если Не ТекДанные = Неопределено Тогда
			Если ЗначениеЗаполнено(ТекДанные.смартКонтейнер) Тогда
				ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(ТекДанные.смартКонтейнер);
				СписокКонтейнеров = смартЗаполнитьСписокНаСервере(ЗначениеДляКонтейнера)
			Иначе
				СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
    смартОткрытьФормуВыбораКонтейнеров(СписокКонтейнеров);
КонецПроцедуры//--#1374 смарт: Балашов 03.07.2023

//++#1374 смарт: Балашов 03.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Функция смартЗаполнитьСписокНаСервере(ЗначениеДляКонтейнера)
	СписокКонтейнеров = Новый СписокЗначений;
	Если ЗначениеДляКонтейнера.Количество() = 0 Тогда
		СписокКонтейнеров = смартПолучитСписокКонтейнеров(Объект.Груз);	
	Иначе	
		Для Каждого СтрКонтейнера Из ЗначениеДляКонтейнера Цикл
			НовыйGUID = Новый УникальныйИдентификатор(СтрКонтейнера.Ссылка);
			СсылкаКонтейнер = Справочники.смартКонтейнеры.ПолучитьСсылку(НовыйGUID);
			СписокКонтейнеров.Добавить(СсылкаКонтейнер,,СтрКонтейнера.Пометка);
		КонецЦикла;
	КонецЕсли;	
	Возврат СписокКонтейнеров;
КонецФункции//--#1374 смарт: Балашов 03.07.2023

//++#1374 смарт: Балашов 15.06.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартОткрытьФормуВыбораКонтейнеров(СписокКонтейнеров)

	НастройкиКомпоновки = Новый НастройкиКомпоновкиДанных;
	Если Не СписокКонтейнеров = Неопределено Тогда
	    ГруппаОтбора = НастройкиКомпоновки.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ПравоеЗначение = СписокКонтейнеров;
	КонецЕсли;	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокКонтейнеров", СписокКонтейнеров);
	ПараметрыФормы.Вставить("МножественныйВыбор", ложь);

	ОбработкаВыбора = Новый ОписаниеОповещения("смартПриЗакрытииФормыВыбораКонтейнеров", ЭтаФорма,"Подбор");
	ОткрытьФорму("Справочник.смартКонтейнеры.Форма.ФормаВыбораКонтейнеров", ПараметрыФормы,
	        ЭтаФорма, , , , ОбработкаВыбора);
КонецПроцедуры//--#1374 смарт: Балашов 15.06.2023	

//++#1374 смарт: Балашов 05.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаСервере
Процедура смартВнестиИзмененияВЗаказПоставщику()
	//++#1517 смарт: Лопато 09.11.2023 //Ошибка при записи документа без заказа
	Если НЕ ЗначениеЗаполнено(Объект.ЗаказПоставщику) Тогда
		Возврат;
	КонецЕсли;	
	//--#1517 смарт: Лопато 09.11.2023
	ДокОснование = Объект.ЗаказПоставщику;
	ОбъектЗаказ = ДокОснование.ПолучитьОбъект();
	Запрос = Новый Запрос;
	Запрос.Текст = "
		|ВЫБРАТЬ
		//++#360 смарт: Тимофеева 15.08.2025 / Формирование приходного ордера, учитывая аналитику Контейнер (ИСМ 1903)
		| смартНомерЗаявкиНаГарантийныйРемонтСсылка,Склад,Назначение,
		//--#360 смарт: Тимофеева 15.08.2025 
		|Номенклатура,Характеристика,смартКонтейнер,Количество
		|ИЗ Документ.ПриобретениеТоваровУслуг.Товары КАК ПТУ_Товары
		|ГДЕ ЗаказПоставщику = &Заказ И Ссылка <> &Ссылка
		//++#360 смарт: Тимофеева 15.08.2025 / Формирование приходного ордера, учитывая аналитику Контейнер (ИСМ 1903)
		| И НЕ ПТУ_Товары.Ссылка.ПометкаУдаления
		//--#360 смарт: Тимофеева 15.08.2025 
		|";
	Запрос.УстановитьПараметр("заказ",ДокОснование); 
	Запрос.УстановитьПараметр("Ссылка",Объект.Ссылка);
	ТЗРеализаций = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрТовары Из Объект.Товары Цикл
		НоваяСтрока = ТЗРеализаций.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрТовары);
	КонецЦикла;	
	//++#360 смарт: Тимофеева 15.08.2025 / Формирование приходного ордера, учитывая аналитику Контейнер (ИСМ 1903)
	//ТЗРеализаций.Свернуть("Номенклатура,Характеристика,смартКонтейнер","Количество"); 
	
	//ВрТЗ = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика");
	//ВрТЗ.Свернуть("Номенклатура, Характеристика");
	
	//Для Каждого стрТЗ Из ВрТЗ Цикл //собираем контейнеры в кучу
	//	ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика");

	ТЗРеализаций.Свернуть("Номенклатура,Характеристика,Склад,Назначение,смартНомерЗаявкиНаГарантийныйРемонтСсылка,смартКонтейнер","Количество");
	
	ВрТЗ = Объект.Товары.Выгрузить(,"Номенклатура, Характеристика,Склад,Назначение,смартНомерЗаявкиНаГарантийныйРемонтСсылка");
	ВрТЗ.Свернуть("Номенклатура, Характеристика,Склад,Назначение,смартНомерЗаявкиНаГарантийныйРемонтСсылка");
	
	Для Каждого стрТЗ Из ВрТЗ Цикл //собираем контейнеры в кучу
		ПараметрыОтбора = Новый Структура("Номенклатура, Характеристика,Склад,Назначение,смартНомерЗаявкиНаГарантийныйРемонтСсылка");
	//--#360 смарт: Тимофеева 15.08.2025 	
	
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора,стрТЗ);
		СтрокиНоменклатуры = ТЗРеализаций.НайтиСтроки(ПараметрыОтбора);//Объект.Товары.НайтиСтроки(ПараметрыОтбора);
		СписокКонтейнеров = смартЗаполнитьСписокНаСервере(Новый Массив);
		Если Не СтрокиНоменклатуры.Количество() = 0 Тогда
			Для Каждого СтрНоменклатура Из СтрокиНоменклатуры Цикл
				Если ЗначениеЗаполнено(СтрНоменклатура.смартКонтейнер) Тогда
					ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(СтрНоменклатура.смартКонтейнер);
					Для Каждого Контейнер Из ЗначениеДляКонтейнера Цикл
						Если Контейнер.Пометка Тогда                  
							НайденныйКонтейнер = СписокКонтейнеров.НайтиПоЗначению(Справочники.смартКонтейнеры.ПолучитьСсылку(Новый УникальныйИдентификатор(Контейнер.Ссылка)));
							Если Не НайденныйКонтейнер = Неопределено Тогда
								НайденныйКонтейнер.Пометка = истина;
							КонецЕсли;	
						КонецЕсли;	
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;	
			СтрокаJSONНоменклатуры = смартОбщегоНазначения.смартЗаписатьВыбраныеКонтейнерыВJSON(СписокКонтейнеров);
			//запишем в заказ поставщику
			НайденыеСтрокиЗаказа = ОбъектЗаказ.Товары.НайтиСтроки(ПараметрыОтбора);
			Для Каждого СтрокаЗаказа Из НайденыеСтрокиЗаказа Цикл
				СтрокаЗаказа.смартКонтейнер = СтрокаJSONНоменклатуры;	
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;	
	Если ОбъектЗаказ.Проведен Тогда Режим = РежимЗаписиДокумента.Проведение Иначе Режим = РежимЗаписиДокумента.Запись КонецЕсли;
	ОбъектЗаказ.Записать(Режим);	
КонецПроцедуры//--#1374 смарт: Балашов 05.07.2023

//++#1374 смарт: Балашов 03.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смартПриЗакрытииФормыВыбораКонтейнеров(Значение, ДопПараметры) Экспорт
    Если Значение = Неопределено Тогда
        Возврат;
	КонецЕсли; 
	
	СтрокаJSON = смартОбщегоНазначения.смартЗаписатьВыбраныеКонтейнерыВJSON(Значение);
	
	ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(СтрокаJSON);

	СписокСтрок = Элементы.Товары.ВыделенныеСтроки;
	Для Каждого Строка_ТЧ Из СписокСтрок Цикл
		ТекСтрока = Объект.Товары.НайтиПоИдентификатору(Строка_ТЧ);
		ТекСтрока.смартКонтейнер = СтрокаJSON;
		Если ТекСтрока.Свойство("Контейнеры") Тогда
			ТекСтрока.Контейнеры = смартОбщегоНазначения.смартКонтейнерыВСтроку(ЗначениеДляКонтейнера);
		КонецЕсли;	
	КонецЦикла;	
	//++#360 смарт: Тимофеева 15.08.2025 / Формирование приходного ордера, учитывая аналитику Контейнер (ИСМ 1903)
	Модифицированность = Истина;
	//--#360 смарт: Тимофеева 15.08.2025   
КонецПроцедуры//--#1374 смарт: Балашов 03.07.2023                                                   

//++#1374 смарт: Балашов 03.07.2023 //Разработать учет закупок в разрезе Контейнеров
&НаКлиенте
Процедура смарт_ТоварыПередОкончаниемРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	смартПеречитатьДанныеКонтейнеров();
КонецПроцедуры//--#1374 смарт: Балашов 03.07.2023

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьУсловноеОформление();

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);

	ПараметрыВыбораРеквизитов = ЭтапыОплатыСервер.ПараметрыВыбораРеквизитовОплаты(Метаданные.Документы.ПриобретениеТоваровУслуг);

	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	ДополнительныеПараметры.Вставить("ОтложеннаяИнициализация", Истина);
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);

	// Обработчик механизма "Назначения"
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтаФорма);

	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма);

	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	ИспользоватьПартнеровКакКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровКакКонтрагентов");
	ИспользоватьУпрощеннуюСхемуОплатыВЗакупках = ПолучитьФункциональнуюОпцию("ИспользоватьУпрощеннуюСхемуОплатыВЗакупках");
	УправлениеСвязямиПараметровВыбораРеквизитовФормы();

	ПоСоглашениюИспользуютсяДоговорыКонтрагентов = ЗначениеЗаполнено(Объект.Соглашение) И ОбщегоНазначенияУТ.ЗначениеРеквизитаОбъектаТипаБулево(Объект.Соглашение, "ИспользуютсяДоговорыКонтрагентов");

	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда

		ПриЧтенииСозданииНаСервере();

		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
		Элементы.КартинкаРасхождениеЗаказ.Картинка = БиблиотекаКартинок.ПустаяКартинка;
		Элементы.КартинкаРасхождениеЗаказы.Картинка = БиблиотекаКартинок.ПустаяКартинка;
	КонецЕсли;
	Если Параметры.ЗаполнятьПоОрдеру
		ИЛИ Параметры.ЗначенияЗаполнения.Свойство("ЗаполнятьПоОрдеру") 
		ИЛИ (ЗначениеЗаполнено(Параметры.Основание) 
		И ТипЗнч(Параметры.Основание) = Тип("Структура")
		И Параметры.Основание.Свойство("ЗаполнятьПоОрдеру")) 
		Тогда
		Если ЭтаФорма.ТолькоПросмотр Тогда    	
			ТекстСообщения = НСтр("ru = 'Нельзя перезаполнить документ ""%Документ%"", т.к. установлена дата запрета изменений!'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Документ%", Объект.Ссылка);			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка,,,);       			
		Иначе 	
			ЗаполнитьПоПриемкеСервер(Ложь);
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;

	УстановитьДоступностьСоглашений();

	ЗакупкиСервер.УстановитьРежимВыбораГруппЭлементовСклада(Элементы.Склад);

	Если Не ИспользоватьЗаказыПоставщикам Тогда
		Элементы.КартинкаОтклонениеЦенЗаказ.Видимость = Ложь;
		Элементы.КартинкаОтклонениеЦенЗаказы.Видимость = Ложь;
		Элементы.КартинкаРасхождениеЗаказ.Видимость = Ложь;
		Элементы.КартинкаРасхождениеЗаказы.Видимость = Ложь;
	КонецЕсли;

	Договор = Объект.Договор;

	Контрагент = Объект.Контрагент;

	ИспользуетсяПоступлениеТоваров = ПолучитьФункциональнуюОпцию("ИспользоватьТоварыВПутиОтПоставщиков");
	Элементы.ТоварыЗаполнитьСерииПоДаннымПоступленияТоваров.Видимость = ИспользуетсяПоступлениеТоваров;

	Если НЕ Объект.ПоступлениеПоЗаказам Тогда
		Элементы.ТоварыИндексКартинки.Видимость = Ложь; 
	КонецЕсли;

	Если ИспользоватьПоступлениеПоНесколькимЗаказам Тогда
		Элементы.ТоварыПодобратьТоварыПоЗаказамОрдерам.Заголовок = НСтр("ru = 'Подобрать товары из заказов'");
	КонецЕсли;

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьСкладыВТабличнойЧастиДокументовЗакупки") И Не ПолучитьФункциональнуюОпцию("ИспользоватьПодразделения") Тогда
		Элементы.ТоварыГруппаПолучатель.Видимость = Ложь;
	ИначеЕсли Не СкладГруппа Тогда
		Элементы.ТоварыГруппаПолучатель.Заголовок = НСтр("ru = 'Подразделение-получатель'");
	КонецЕсли;

	Если КлиентскоеПриложение.ТекущийВариантИнтерфейса() = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		Элементы.ГруппаИтого.ЦветФона = Новый Цвет();
	КонецЕсли;

	УстановитьЗаголовокЗаполнитьПоЗаказамОрдерам();

	НаправлениеДеятельностиОбязательно = НаправленияДеятельностиСервер.УказаниеНаправленияДеятельностиОбязательно(Объект.ХозяйственнаяОперация);

	СформироватьНадписьВалюты(ЭтаФорма);

	Элементы.ЗакрытьЗаказ.Доступность = ПравоДоступа("Изменение",Метаданные.Документы.ЗаказПоставщику);

	УстановитьВидимостьКоличестваРНПТ();

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПриСозданииНаСервереДокумент(ЭтотОбъект, Параметры);
	ПроверкаКонтрагентовВызовСервераПереопределяемыйУТ.ФормаДокументаПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	УстановитьДоступностьКомандБуфераОбмена();
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ПараметрыЭДОПриСоздании = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаДокумента();
	ПараметрыЭДОПриСоздании.Форма = ЭтотОбъект;
	ПараметрыЭДОПриСоздании.ДокументССылка = Объект.Ссылка;
	ПараметрыЭДОПриСоздании.ДекорацияСостояниеЭДО = Элементы.ДекорацияСостояниеЭДО;
	ПараметрыЭДОПриСоздании.ГруппаСостояниеЭДО = Элементы.ГруппаСостояниеЭДО;
	ПараметрыЭДОПриСоздании.МестоРазмещенияКоманд = Элементы.ПодменюЭДО;

	ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаДокумента(ПараметрыЭДОПриСоздании);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// ЭлектронноеВзаимодействие.СервисДоставки
	СервисДоставки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ЭлектронноеВзаимодействие.СервисДоставки

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьПризнакАналитикаРасходовОбязательна(Объект.Товары);
	ПланыВидовХарактеристик.СтатьиРасходов.ЗаполнитьПризнакАналитикаРасходовЗаказРеализация(Объект.Товары);
	
	#Вставка
	//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
	ДобавляемыеРеквизиты = Новый Массив; 
	
	ТипБулево = Новый ОписаниеТипов("Булево");
	ТипДата = Новый ОписаниеТипов("Дата");
	
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ВестиСведенияДляДекларацийАлкоВРознице", ТипБулево));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ДатаНачалаЗакупокПоЕГАИС", ТипДата));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("НеВыполнятьПроверкуСопоставленнойНоменклатурыПоставщика", ТипБулево, , Истина));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("смартДопРасходыВнесены", ТипБулево, , "Доп расходы внесены"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТекстДокументаЕГАИС", Новый ОписаниеТипов("ФорматированнаяСтрока")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТекстУведомленияГИСМ", Новый ОписаниеТипов("ФорматированнаяСтрока")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТТНВходящаяЕГАИС", Новый ОписаниеТипов("ДокументСсылка.ТТНВходящаяЕГАИС")));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТТНВходящаяЕГАИСОбновитьФорму", ТипБулево, "", "ТТН Входящая ЕГАИС (обновить форму)"));
	ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("смартОтветственныйЗаДопРасходы", 
		Новый ОписаниеТипов("СправочникСсылка.Пользователи"),
		,
		"Ответственный за внесение доп. расходов"));
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	НоваяГруппа = Элементы.Вставить("ГруппаГруз", Тип("ГруппаФормы"), Элементы.ГруппаОсновное, Элементы.ГруппаОплата);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	НовыйЭлемент = Элементы.Добавить("Груз", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.Груз";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ГрузПриИзменении"); 
	
	НоваяДекорация = Элементы.Добавить("ДекорацияГруз", Тип("ДекорацияФормы"), НоваяГруппа);
	НоваяДекорация.Вид = ВидДекорацииФормы.Надпись;
	НоваяДекорация.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Лево;
	
	НоваяГруппа = Элементы.Добавить("смартГруппаДопРасходов", Тип("ГруппаФормы"));
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	НовыйЭлемент = Элементы.Добавить("смартДопРасходыВнесены", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
	НовыйЭлемент.ПутьКДанным = "смартДопРасходыВнесены";  
	НовыйЭлемент.Подсказка = "По данному документу приобретения внесены все дополнительные расходы.";
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "смартДопРасходыВнесеныПриИзменении"); 

	НовыйЭлемент = Элементы.Добавить("смартОтветственныйЗаДопРасходы", Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеНадписи;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.ПутьКДанным = "смартОтветственныйЗаДопРасходы";
	НовыйЭлемент.Подсказка = "Ответственное лицо установившее признак, что все дополнительные расходы по документу приобретения уже внесены.";
	
	Элементы.Товары.УстановитьДействие("ПередОкончаниемРедактирования", "смарт_ТоварыПередОкончаниемРедактированияПосле");
	//-- #Б-964 смарт: Мосолов 06.11.2024
	
	//Богус++
	//Элементы.СтатусГруза.ТолькоПросмотр = Не ЗначениеЗаполнено(Объект.Груз);
	//Богус--
	// Фролоа+
	ДоступностьЭлементаГруз();
	Элементы.Дата.ТолькоПросмотр=Не ПравоДоступа("Изменение",Метаданные.Документы.ПриобретениеТоваровУслуг);
	
	смартДопРасходыВнесены=смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка,"смартДопРасходыВнесены");
	смартОтветственныйЗаДопРасходы=смартСервер.ПолучитьДанныеПодписаногоДокумента(Объект.Ссылка,"смартОтветственныйЗаДопРасходы");
	//Элементы.смартДопРасходыВнесены.Доступность=ПравоДоступа("Изменение",Метаданные.Документы.ПриобретениеУслугПрочихАктивов);
	// Фролов-
	
	//++ смарт:ММ #006 144 04.12.2019
	НастроитьВидимостьДоступностьЭлементов();
	//-- смарт:ММ 04.12.2019

	//++ смарт:ММ 221 19.07.2021
	ДобавитьЭлементыПрограммно();
	//-- смарт:ММ 19.07.2021

	#КонецВставки
	
КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаСервере
&ИзменениеИКонтроль("ПередЗаписьюНаСервере")
Процедура смарт_ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентов.ПередЗаписьюНаСервереДокумент(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	// Конец ИнтеграцияС1СДокументооборотом
	
	#Вставка
	//++#1374 смарт: Балашов 04.07.2023 //Разработать учет закупок в разрезе Контейнеров
	смартПроверитьВозможностьЗаписиПоКонтейнерам(Отказ);
	//--#1374 смарт: Балашов 04.07.2023
	#КонецВставки
	
КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024  

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаКлиенте
&ИзменениеИКонтроль("ХозяйственнаяОперацияПриИзменении")
Процедура смарт_ХозяйственнаяОперацияПриИзменении(Элемент)

	ХозяйственнаяОперацияПриИзмененииСервер();
	
	#Вставка
	//++ смарт:Подкин #962 05.04.2022 16:48:32
	НастроитьВидимостьДоступностьЭлементов();
	//-- смарт:Подкин #962 05.04.2022 16:48:32
	#КонецВставки
	
КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
Процедура смарт_ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	ПредыдущиеРеквизитыСтроки = Новый Структура(
	"НоменклатураПартнера,
	|Номенклатура,
	|Характеристика,
	|Назначение,
	|Упаковка,
	|Количество,
	|КоличествоУпаковок,
	|Склад,
	|ТипНоменклатуры,
	|ХарактеристикиИспользуются,
	|ЗаказПоставщику,
	|КодСтроки");

	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");

	// СтандартныеПодсистемы.РаботаСКонтрагентами
	ПроверкаКонтрагентовКлиент.ПриОткрытииДокумент(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.РаботаСКонтрагентами

	// ЭлектронноеВзаимодействие.ОбменСКонтрагентами
	ОбменСКонтрагентамиКлиент.ПриОткрытии(ЭтотОбъект);
	// Конец ЭлектронноеВзаимодействие.ОбменСКонтрагентами

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	#Вставка
	//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
		смартПеречитатьДанныеКонтейнеров();
	//--#1374 смарт: Балашов 21.06.2023
	#КонецВставки
	
КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаКлиенте
&ИзменениеИКонтроль("ПослеЗаписи")
Процедура смарт_ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("Запись_ПриобретениеТоваровУслуг", ПараметрыЗаписи, Объект.Ссылка);

	СобытияФормКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);

	ОбщегоНазначенияУТКлиент.ВыполнитьДействияПослеЗаписи(ЭтаФорма, Объект, ПараметрыЗаписи);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	#Вставка
	//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
	смартВнестиИзмененияВЗаказПоставщику();		
	n = Новый Структура("Ключ", Объект.ЗаказПоставщику);
	ФормаЗаказа = ПолучитьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", n);
	ФормаЗаказа.Прочитать();
	Оповестить("ИзменениеДанныхПТУ",,ЭтотОбъект);
	
	смартПеречитатьДанныеКонтейнеров();
	//--#1374 смарт: Балашов 21.06.2023
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаВыбора")
Процедура смарт_ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)

	Если ИсточникВыбора.ИмяФормы = "Обработка.ЖурналДокументовЗакупки.Форма.ФормаПодбораТоваровИзЗаказа" Тогда

		ПолучитьТоварыИзХранилища(РезультатВыбора.АдресТоваровВХранилище);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборТоваровВДокументЗакупки.Форма.Форма" Тогда

		ОбработкаВыбораПодборНаСервере(РезультатВыбора);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РедактированиеВзаиморасчетов" Тогда

		ПолучитьРасшифровкуПлатежаИзХранилища(РезультатВыбора.АдресПлатежейВХранилище);

	ИначеЕсли УчетНДСУПКлиент.ЗаконченоРедактированиеСчетаФактурыПолученного(РезультатВыбора, ИсточникВыбора) Тогда

		ОбновитьТекстСчетаФактурыПолученные();	
		//++ Локализация
	ИначеЕсли ПрослеживаемостьФормыКлиентПереопределяемый.ЗаконченоРедактированиеУведомленияОВвозеПрослеживаемыхТоваров(ИсточникВыбора) Тогда

		ОбновитьТекстСчетаФактурыПолученные();
		//-- Локализация

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ПодборМногооборотнойТары.Форма.Форма" Тогда

		ЗаполнитьМногооборотнуюТаруИзХранилищаСервер(РезультатВыбора.АдресМногооборотнойТарыВХранилище);
		МногооборотнаяТараКлиент.ОповеститьПользователяОЗаполненииМногооборотнойТарой();

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЗагрузкаДанныхИзВнешнихФайлов.Форма.Форма" Тогда

		ПолучитьЗагруженныеТоварыИзХранилища(РезультатВыбора);

	ИначеЕсли НоменклатураКлиент.ЭтоУказаниеСерий(ИсточникВыбора) Тогда

		НоменклатураКлиент.ОбработатьУказаниеСерии(ЭтаФорма, ПараметрыУказанияСерий, РезультатВыбора);

	ИначеЕсли ИсточникВыбора.ИмяФормы = "Справочник.СтруктураПредприятия.Форма.ФормаВыбора" Тогда

		ВыделенныеСтроки = Элементы.Товары.ВыделенныеСтроки;

		Для Каждого Строка Из ВыделенныеСтроки Цикл

			ДанныеСтроки = Объект.Товары.НайтиПоИдентификатору(Строка);

			Если ДанныеСтроки.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Или
				ДанныеСтроки.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.МногооборотнаяТара") Тогда
				Продолжить;
			КонецЕсли;

			ДанныеСтроки.Подразделение = РезультатВыбора;

		КонецЦикла;

	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.РеквизитыПечатиАвансовогоОтчета" Тогда

		Если РезультатВыбора <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора);
		КонецЕсли;

	КонецЕсли;

	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;

	УстановитьПризнакЗаполненияСклада();
	
	#Вставка
	//++#1374 смарт: Балашов 21.06.2023 //Разработать учет закупок в разрезе Контейнеров
	смартПеречитатьДанныеКонтейнеров();
	//--#1374 смарт: Балашов 21.06.2023
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки
	
КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

//++ #Б-964 смарт: Мосолов 06.11.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. ПриобретениеТоваровУслуг 
&НаКлиенте
&ИзменениеИКонтроль("ТоварыВыбор")
Процедура смарт_ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если Элементы.Товары.ТекущиеДанные <> Неопределено Тогда

		Если Поле = Элементы.ТоварыЗаказПоставщику Тогда

			Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ЗаказПоставщику) Тогда
				ПоказатьЗначение(Новый ОписаниеОповещения("ТоварыВыборЗавершение", ЭтотОбъект, Новый Структура("Поле", Поле)), Элементы.Товары.ТекущиеДанные.ЗаказПоставщику);
				Возврат;
			ИначеЕсли ЗначениеЗаполнено(Объект.ЗаказПоставщику) Тогда
				ПоказатьЗначение(Новый ОписаниеОповещения("ТоварыВыборЗавершение", ЭтотОбъект, Новый Структура("Поле", Поле)), Объект.ЗаказПоставщику);
				Возврат;
			КонецЕсли;

		ИначеЕсли Поле = Элементы.ТоварыСделка Тогда

			ПоказатьЗначение(, Элементы.Товары.ТекущиеДанные.Сделка);

		КонецЕсли;

		НоменклатураПартнеровКлиент.ПриВыбореНоменклатурыПартнера(Объект, Поле, "ТоварыНоменклатураПартнера", НСтр("ru = 'Поставщик'"));

	КонецЕсли;         
	
	#Вставка
	//++#1374 смарт: Балашов 03.07.2023 //Разработать учет закупок в разрезе Контейнеров
	Если Поле.ГиперссылкаЯчейки и Поле.Имя = "Контейнеры" Тогда
		СтандартнаяОбработка = Ложь;              
		ТекДанные = Элементы.Товары.ТекущиеДанные;
		ЗначениеДляКонтейнера = смартОбщегоНазначения.смартПолучитьМассивКонтейнеров(ТекДанные.смартКонтейнер);
		СписокКонтейнеров = смартЗаполнитьСписокНаСервере(ЗначениеДляКонтейнера);
		смартОткрытьФормуВыбораКонтейнеров(СписокКонтейнеров);
	КонецЕсли;
	//--#1374 смарт: Балашов 03.07.2023
	#КонецВставки

КонецПроцедуры //-- #Б-964 смарт: Мосолов 06.11.2024

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(Объект.Товары);
	
КонецПроцедуры


//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура смартТоварыПриИзменении(Элемент)

	ЗаполнитьДанныеОМаркировкеНоменклатуры();

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ТоварыПриИзменении")
Процедура смарт_ТоварыПриИзменении(Элемент)

	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

	Если Объект.ПоступлениеПоЗаказам Тогда 
		Если Объект.Товары.Количество()>0 И ТекущаяСтрока <> Неопределено Тогда
			Если ТекущаяСтрока.КодСтроки = 0 Тогда
				ТекущаяСтрока.РасхождениеЗаказ = 1;
			Иначе
				ТекущаяСтрока.РасхождениеЗаказ = 0;
			КонецЕсли;
		КонецЕсли;
		ОбновитьЗависимыеРеквизитыФормыПоЗаказу(
		Объект.Товары,
		НадписьРасхождениеЗаказ, 
		Элементы.КартинкаРасхождениеЗаказ,
		Элементы.КартинкаРасхождениеЗаказы);
	КонецЕсли;
	
	#Вставка
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026
	#КонецВставки

КонецПроцедуры

#КонецОбласти
